#include <stdio.h>
#include <stdlib.h>

void regulations();
void menu();
void menu1();
void error();
void exit1();
void victory();
void new_menu();

int num;
int num1;

int main()
{   
    system("clear");
    menu();
   while(1){
        switch(num){ 
            case 1:
                system("clear");
                printf("Игра началась) \n");
                victory();
                new_menu();
            break;
            case 2:
                system("clear");
                regulations();
                menu1();
            break;
            case 3:
                system("clear");
                exit1();
            break;
            case 4:
                system("clear");
                printf("Игра началась)\n");
                menu();
            break;
            case 5:
                system("clear");
                exit1();
            break;
            default:
                system("clear");
                error();
                menu();
            break;
        }
    }   

    return 0;
}

void menu(){
    printf ("                           PONG\n");
    printf ("--------------------------------------------------------\n");
    printf ("|                   <1> Начало Игры                    |\n");
    printf ("|                   <2> Правила Игры                   |\n");
    printf ("|                   <3> Выход из игры                  |\n");
    printf ("--------------------------------------------------------\n");
    scanf("%d", &num);
    
}

void menu1(){
    printf ("                           PONG\n");
    printf ("--------------------------------------------------------\n");
    printf ("|                   <1> Начало Игры                    |\n");
    printf ("|               <2> Повторить Правила Игры?            |\n");
    printf ("|                   <3> Выход из Игры                  |\n");
    printf ("--------------------------------------------------------\n");
    scanf("%d", &num);
  
}  

void regulations() 
{
    printf ("--------------------------------------------------------\n");
    printf ("|                 ПРАВИЛА ИГРЫ В PONG                  |\n");
    printf ("--------------------------------------------------------\n");
    printf ("| Игроки ходят по очереди.                             |\n");
    printf ("| После удара ракеткой первого игрока ход передаётся   |\n");
    printf ("| второму игрокую                                      |\n");
    printf ("| Игра ведётся до набора одного из играков 21-го очка! |\n");
    printf ("--------------------------------------------------------\n");
    printf ("|                Управления ракетками                  |\n");
    printf ("--------------------------------------------------------\n");
    printf ("|     Первый Игрок         |         Второй игрок      |\n");
    printf ("--------------------------------------------------------\n");
    printf ("|      Вверх < A >         |          Вверх < K >      |\n");
    printf ("|      Вниз  < Z >         |          Вниз  < M >      |\n");
    printf ("--------------------------------------------------------\n");
    printf ("| Пропуск хода осуществляется общей кнопкой ПРОБЕЛОМ!  |\n");
    printf ("--------------------------------------------------------\n");

}
       
void error(){
    printf ("--------------------------------------------------------\n");
    printf("| Что-то пошло не так!                                  |\n");
    printf("| Прошу выбери нужный пункт меню!                       |\n");
    printf ("--------------------------------------------------------\n");
}

void victory(){
    printf ("--------------------------------------------------------\n");
    printf("| Поздравляю с победой Игрок 1/2!                        |\n");
    printf("| Не хотите ещё сыграть в Pong?                          |\n");
    printf ("--------------------------------------------------------\n");
}

void new_menu(){
    printf ("--------------------------------------------------------\n");
    printf("|                   < 4 > Новая Игра                     |\n");
    printf("|                   < 5 > Выйти из Игры                  |\n");
    printf ("--------------------------------------------------------\n");
    scanf("%d", &num);
   
}

void exit1(){
    exit(0);
}

/*int main(){
    int a = 0;
    int x = scanf("%d", &a);
    if (x != 1)
    {
        printf("n/a");
    }
      printf("jr");
return 0;
}*/
