#include <stdio.h>
#include <stdlib.h>

void printing_menu() {
    printf("                           PONG\n");
    printf("--------------------------------------------------------\n");
    printf("|                   <1> Начало Игры                    |\n");
    printf("|                   <2> Правила Игры                   |\n");
    printf("|                   <3> Выход из игры                  |\n");
    printf("--------------------------------------------------------\n");
}

void victory() {
    printf("--------------------------------------------------------\n");
    printf("| Поздравляю с победой Игрок 1/2!                        |\n");
    printf("| Не хотите ещё сыграть в Pong?                          |\n");
    printf("--------------------------------------------------------\n");
}

void regulations()
{
    printf("--------------------------------------------------------\n");
    printf("|                 ПРАВИЛА ИГРЫ В PONG                  |\n");
    printf("--------------------------------------------------------\n");
    printf("| Игроки ходят по очереди.                             |\n");
    printf("| После удара ракеткой первого игрока ход передаётся   |\n");
    printf("| второму игрокую                                      |\n");
    printf("| Игра ведётся до набора одного из играков 21-го очка! |\n");
    printf("--------------------------------------------------------\n");
    printf("|                Управления ракетками                  |\n");
    printf("--------------------------------------------------------\n");
    printf("|     Первый Игрок         |         Второй игрок      |\n");
    printf("--------------------------------------------------------\n");
    printf("|      Вверх < A >         |          Вверх < K >      |\n");
    printf("|      Вниз  < Z >         |          Вниз  < M >      |\n");
    printf("--------------------------------------------------------\n");
    printf("| Пропуск хода осуществляется общей кнопкой ПРОБЕЛОМ!  |\n");
    printf("--------------------------------------------------------\n");
    printf("--------------------------------------------------------\n");
    printf("| ПРИ НАЖАТИЕ ЛЮБЫХ ДРУГИХ КНОПАК, ИГРА УМИРАЕТ!       |\n");
    printf("--------------------------------------------------------\n");
}

void error() {
    printf("--------------------------------------------------------\n");
    printf("| Что-то пошло не так!                                 |\n");
    printf("| Прошу прочитай внимательно правила!                  |\n");
    printf("| Следуйте правилам и не нажимайте ничего лишнего!     |\n");
    printf("| Запустите игру заново!                               |\n");
    printf("--------------------------------------------------------\n");
}

int processing_actions() {
    int com_number;
    char incorrect_input = 0;
    printing_menu();
    while (scanf_s("%d", &com_number) || scanf_s("%c", &incorrect_input)) {
        system("cls");
        if (incorrect_input != 0) {
            com_number = 0;
            incorrect_input = 0;
        }
        switch (com_number) {
        case 1:
            printf("Игра началась) \n");
            // starig of the game
            victory();
            printing_menu();
            break;
        case 2:
            regulations();
            printing_menu();
            break;
        case 3:
            exit(0);
            break;
        default:
            error();
            printing_menu();
            break;
        }
    }
}
